rbkhan0229/BRRS/Drivers/API/Build_Platforms/nRF52840-DK/Source/platform/deca_spi.h
/*! ----------------------------------------------------------------------------
 * @file    deca_spi.h
 * @brief   SPI access functions
 *
 * @attention
 *
 * Copyright 2015 - 2021 (c) DecaWave Ltd, Dublin, Ireland.
 *
 * All rights reserved.
 *
 * @author DecaWave
 */

#ifndef _DECA_SPI_H_
#define _DECA_SPI_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include <boards.h>
#include <deca_types.h>
#include <nrf_drv_spi.h>
#include <sdk_config.h>

#define DECA_MAX_SPI_HEADER_LENGTH (3) // max number of bytes in header (for formating & sizing)

#define DATALEN1 200

#ifndef BRRS_OPT_SPIM_START_END_PROFILE
#define BRRS_OPT_SPIM_START_END_PROFILE 0
#endif

    typedef enum
    {
        DW_HAL_NODE_UNLOCKED = NRF_SUCCESS,
        DW_HAL_NODE_LOCKED = NRF_ERROR_BUSY
    } dw_hal_lockTypeDef;

#define __HAL_LOCK(__HANDLE__)                                                                                                                                 \
    do                                                                                                                                                         \
    {                                                                                                                                                          \
        if ((__HANDLE__)->lock == DW_HAL_NODE_LOCKED)                                                                                                           \
        {                                                                                                                                                      \
            return NRF_ERROR_BUSY;                                                                                                                             \
        }                                                                                                                                                      \
        else                                                                                                                                                   \
        {                                                                                                                                                      \
            (__HANDLE__)->lock = DW_HAL_NODE_LOCKED;                                                                                                            \
        }                                                                                                                                                      \
    } while (0U)

#define __HAL_UNLOCK(__HANDLE__)                                                                                                                               \
    do                                                                                                                                                         \
    {                                                                                                                                                          \
        (__HANDLE__)->lock = DW_HAL_NODE_UNLOCKED;                                                                                                              \
    } while (0U)

    /* description of spi interface to DW3000 chip */
    typedef struct
    {
        nrf_drv_spi_t spi_inst;
        uint32_t frequency_slow;
        uint32_t frequency_fast;
        uint32_t csPin;
        nrf_drv_spi_config_t spi_config;
        dw_hal_lockTypeDef lock;
    } spi_handle_t;

/* description of connection to the DW3700 chip */
typedef struct
{
  uint16_t        irqPin;
  uint16_t        rstPin;
  uint16_t        wkupPin;
  uint16_t        csPin;
  spi_handle_t    *pSpi;
}dw_t;

typedef struct
{
    uint32_t begin_count;
    uint32_t end_count;
    uint32_t recovery_count;
    uint32_t transfer_error_count;
    uint32_t state_error_count;
    uint32_t direct_transfer_count;
    uint32_t direct_timeout_count;
    uint8_t active;
} dw_spi_burst_stats_t;

#if BRRS_OPT_SPIM_START_END_PROFILE
typedef struct
{
    uint32_t count;
    uint32_t min_ticks;
    uint32_t max_ticks;
    uint64_t sum_ticks;
    uint32_t p99_ticks;
    uint32_t timeout_count;
    uint32_t histogram_overflow;
    uint32_t register_mismatch;
} dw_spim_start_end_profile_t;
#endif

/* @fn    nrf52840_dk_spi_init
 * Initialise nRF52840-DK SPI
 * */
void nrf52840_dk_spi_init(void);

/* @fn    spi2_init
 * Initialise nRF52840-DK SPI2
 * */
void spi2_init(void);

/* @fn      port_set_dw_ic_spi_slowrate
 * @brief   set 2MHz
 * */
void port_set_dw_ic_spi_slowrate(void);

    /* @fn      port_set_dw_ic_spi_fastrate
     * @brief   set 16MHz
     * */
    void port_set_dw_ic_spi_fastrate(void);

    /* Keep the currently selected SPIM peripheral enabled across a bounded
     * DATA burst. Chip select is still toggled for every transaction. */
    int32_t port_dw_spi_burst_begin(void);
    int32_t port_dw_spi_burst_end(void);
    void port_dw_spi_burst_force_recover(void);
    void port_dw_spi_burst_get_stats(dw_spi_burst_stats_t *stats);
#if BRRS_OPT_SPIM_START_END_PROFILE
    int32_t port_dw_spim_start_end_profile(
        dw_spim_start_end_profile_t *profile);
#endif

    /*! ------------------------------------------------------------------------------------------------------------------
     * Function: writetospiwithcrc()
     *
     * Low level abstract function to write to the SPI when SPI CRC mode is used
     * Takes two separate byte buffers for write header and write data, and a CRC8 byte which is written last
     * returns 0 for success, or -1 for error
     */
    int32_t writetospiwithcrc(uint16_t headerLength, const uint8_t *headerBuffer, uint16_t bodyLength, const uint8_t *bodyBuffer, uint8_t crc8);

    /*! ------------------------------------------------------------------------------------------------------------------
     * Function: writetospi()
     *
     * Low level abstract function to write to the SPI
     * Takes two separate byte buffers for write header and write data
     * returns 0 for success, or -1 for error
     */
    int32_t writetospi(uint16_t headerLength, const uint8_t *headerBuffer, uint16_t bodyLength, const uint8_t *bodyBuffer);

    /*! ------------------------------------------------------------------------------------------------------------------
     * Function: readfromspi()
     *
     * Low level abstract function to read from the SPI
     * Takes two separate byte buffers for write header and read data
     * returns the offset into read buffer where first byte of read data may be found,
     * or returns -1 if there was an error
     */
    //#pragma GCC optimize ("O3")
    int32_t readfromspi(uint16_t headerLength, uint8_t *headerBuffer, uint16_t readLength, uint8_t *readBuffer);

#ifdef __cplusplus
}
#endif

#endif /* _DECA_SPI_H_ */
